Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: An example of this is matrix multiplication, where in general A * B != B * A.
ja: 例えば行列の乗算は、A * B != B * Aが基本的に成り立つ非可換演算です。

source: An inefficient way to do this would be to replicate the vector to the size of the matrix:
ja: 非効率的な方法は ベクトルをマトリックスのサイズに複製することができます。

source: An inner constructor method is like an outer constructor method, except for two differences:
ja: 内部コンストラクタのメソッド は、2つの違いを除いて、外部コンストラクタメソッドのようなものです。

source: An object that represents an array of scalar indices and can be converted to such by `to_indices`.
ja: スカラーインデックスの配列を表すオブジェクトであって、"to_indices"によって変換されることが可能である。

source: An object that represents an array of scalar indices and can be converted to such by `to_indices`. By default this includes:
ja: スカラーインデックスの配列を表すオブジェクトで、によって変換されて、によって変換されます。デフォルトでは、次のようになります。

source: Another way to view expressions is with Meta.show_sexpr, which displays the S-expression
ja: 式を表示するもう一つの方法は、Meta.show_screenであり、S式を表示します。セクプル

source: Any Julia type that is not a subtype of `Signed` is assumed to be unsigned.
ja: '署名されたのサブタイプではないジュリア型は、符号なしであると仮定されます。

source: Any custom array of scalar indices that is a subtype of AbstractArray
ja: AbstractArrayのサブタイプであるスカラーインデックスの任意のカスタム配列

source: Any object that defines this function is iterable and can be used in the (@ref lib-collections-iteration).
ja: この関数を定義するすべてのオブジェクトは、iterableであることができ、(@ref libコレクション反復)で使用できます。

source: Any object that has `axes` and supports indexing can participate as an argument in broadcasting, and by default the result is stored in an Array.
ja: '軸を持つすべてのオブジェクトをサポートします。 インデックス作成はブロードキャスト時に引き数として参加することができ、デフォルトではその結果は格納される アレイで使用されます。

source: Any operation that throws an error is probably currently unimplemented and should be posted as a bug so that it can be resolved.
ja: エラーをスローする操作は、現在実装されていないため、次のように記述する必要があります。 バグを解決できるようにします。

source: Applied to the sub2ind example above, it would look like this:
ja: 上記のsub2indの例に適用されますが、次のようになります。

source: Applying it to any other types of arguments will result in a `MethodError`:
ja: この関数定義を他の型の引数に適用すると、次のような`MethodError`になります。:

source: Arbitrary Precision Arithmetic
ja: 任意精度計算

source: Argument Passing Behavior
ja: 引数渡しの振る舞い

source: Arguments to `ccall` are as follows:
ja: 引数 'ccall'は次のようになります。

source: Arguments to `@cfunction` are as follows:
ja: `@cfunction`への引数は次のとおりです。

source: Arithmetic Operators
ja: 算術演算子

source: Arithmetic on the Ptr type in Julia (e.g. using +) does not behave the same as C's pointer arithmetic.
ja: Ptrの算術は、ジュリア(例えば+)の場合と同じように、Cのポインタと同じように動作しません。 演算。

source: Array and Vectorized Operators and Functions
ja: 配列演算子とベクトル化演算子と関数

source: Array data structures are typically defined in one of two ways: either it most efficiently accesses its elements using just one index (linear indexing) or it intrinsically accesses the elements with indices specified for every dimension.
ja: アレイ・データ構造は通常 2つの方法の一つで定義されています:1つのインデックスのみを使用して、その要素に最も効率的にアクセスすることができます (linear indexing)または本質的に、すべての次元に指定されたインデックスを持つ要素にアクセスします。

source: Array traits
ja: 配列特性

source: Arrays can be constructed and also concatenated using the following functions:
ja: 配列は、次の関数を使用して構成したり、連結することもできます。

source: Arrays can easily be sorted according to an arbitrary transformation of their values:
ja: 配列は、値の任意の変換に従って簡単に並べ替えることができます。

source: Arrays of CartesianIndex{N} (see below for more details)
ja: CartesianIndex{N}(詳細については以下を参照)のアレイ

source: Arrays of CartesianIndex{N} are also supported.
ja: CartesianIndex{N}のアレイもサポートされている。

source: Arrays of CartesianIndex{N} are also supported. They represent a collection of scalar indices that each span N dimensions, enabling a form of indexing that is sometimes referred to as pointwise indexing. For example, it enables accessing the diagonal elements from the first "page" of A from above:
ja: CartesianIndex{N}の配列もサポートされています。これらはコレクションを表します。 各スパンNの各次元を使用可能にするスカラー指数のことで、索引の形式が可能になります。 これはポイントインデキシングと呼ばれることがあります。たとえば、次のようになります。 上からのAの最初の「ページ」からの対角線要素へのアクセス

source: Arrays of booleans, which select elements at their true indices (see below for more details)
ja: ブール値の配列で、真のインデックスで要素を選択します(詳細については、以下を参照)。

source: Arrays of parameters can be expressed with NTuple:
ja: パラメータの配列は、NUpsetで表現することができます。

source: Arrays of plain data types exhibit the same behavior.
ja: プレーン・データ型の配列は、同じ動作を示します。

source: Array{Ref,1} to hold these values, until the C library notifies you that it is finished with them.
ja: 配列{Ref,1}を指定して、次の値を保持します。 Cライブラリは、それが完了したことを通知します。

source: As (@ref man-characters), in character literals, Unicode code points can be represented using Unicode \u and \U escape sequences, as well as all the standard C escape sequences.
ja: 上記 (@ref man-characters), の通り、 文字列リテラルでは、Unicodeコードポイントは、C言語の標準的なエスケープ方法と同様に、Unicodeは \u および \U の エスケープを使用することで表すことができます。こ

source: As a complete but simple example, the following calls the clock function from the standard C library:
ja: 完全ではあるが単純な例として、以下の呼び出しは標準Cからクロック関数を呼び出します。 ライブラリ:

source: As a more complicated example, let's define our own toy N-dimensional sparse-like array type built on top of `Dict`:
ja: より複雑な例として、独自の玩具N次元の疎な配列タイプの配列を作成します。 top of'Dict':

source: As a result, the code may produce a memory leak if result_array never gets freed by the garbage collector, or if the garbage collector prematurely frees result_array, the C function may end up throwing an invalid memory access exception.
ja: 結果として、result_arrayが決して実行されない場合、コードはメモリリークを生成する可能性があります。 ガーベッジ・コレクタによって解放されるか、ガーベッジ・コレクタがの結果_arrayを早期に解放するか C関数は、無効なメモリアクセス例外をスローする可能性があります。

source: As a result, the type of the variable may change.
ja: これにより、変数の型が変更されることがあります。

source: As a special part of this syntax, the end keyword may be used to represent the last index of each dimension within the indexing brackets, as determined by the size of the innermost array being indexed.
ja: この構文の特殊な部分として、endキーワードを使用して、最後のインデックスを表すことができます。 最も内側の配列のサイズによって決定される、索引付けブラケット内の各寸法 インデックス化されています。

source: As a special part of this syntax, the end keyword may be used to represent the last index of each dimension within the indexing brackets, as determined by the size of the innermost array being indexed. Indexing syntax without the end keyword is equivalent to a call to `getindex`:
ja: この構文の特殊な部分として、endキーワードを使用して、最後のインデックスを表すことができます。 最も内側の配列のサイズによって決定される、索引付けブラケット内の各寸法 インデックス作成されています。endキーワードなしのインデックス構文は、`getindex'への呼び出しと同じです。

source: As an abstraction, an environment provides three maps: roots, graph and paths.
ja: 抽象化として、環境は3つのマップを提供します。ルーツ、グラフ、パスの各パス。

source: As an alternative, Julia allows interpolation of literals or expressions into quoted expressions.
ja: 代わりに、Juliaは、補間を可能にします。 リテラルまたはエクスプレッションを引用して表現します。

source: As an example, suppose a package directory has the following structure and content:
ja: たとえば、パッケージディレクトリに次の構造と内容があるとします。

source: As an example, the builtin AbstractRange objects use this machinery to optimize pieces of broadcasted expressions that can be eagerly evaluated purely in terms of the start, step, and length (or stop) instead of computing every single element.
ja: たとえば、組み込みのAbstractRangeオブジェクトは、この機械を使用してピースを最適化します。 純粋に評価された表現の始まりです 1つの要素を計算するのではなく、ステップと長さ(または停止)を計算します。

source: As another example, here is a function that doubles any numeric argument, but leaves expressions alone:
ja: 別の例としては、数値引数を2倍にする関数がありますが、式は次のようになります。 単独:

source: As can be seen, A is changed to the sorted array [-2.7, 1.3, 3.1, 4.4].
ja: 図示されるように、Aは、ソートされたアレイ[-2.7、1.3、3.1、4.4]に変更される。

source: As can be seen, A is changed to the sorted array [-2.7, 1.3, 3.1, 4.4]. Note that Julia knows how to convert an array into a Ptr{Cdouble}, how to compute the size of a type in bytes (identical to C's sizeof operator), and so on. For fun, try inserting a println("mycompare($a, $b)")
ja: 図のように、Aはソートされた配列[-2.7、1.3、3.1、4.4]に変更されることに注意してください。 配列をPtr{Cdouble}に変換する方法を知っています。バイト単位でタイプのサイズを計算する方法 (Cのsizeof演算子と同じ)。遊びの場合はprintln("ミコンパレ($a, $b)")を挿入してください。

source: As for hexadecimal literals, binary and octal literals produce unsigned integer types.
ja: 16進数のリテラルに関しては、バイナリと8進数のリテラルは符号なしの整数型を生成します。

source: As for numeric arrays, choosing a non-stable default algorithm for array types for which the notion of a stable sort is meaningless (i.e. when two values comparing equal can not be distinguished) may make sense.
ja: 数値配列については、概念が存在する配列タイプに対して、安定していないデフォルトアルゴリズムを選択してください。 安定したソートは意味がありません(つまり、等しい値を比較する2つの値が区別されない場合) 意味があるかもしれません。

source: As hinted above, one extremely useful feature of Julia is the capability to generate and manipulate Julia code within Julia itself.
ja: 上で示唆したように、Juliaの非常に有用な機能の一つは、生成と操作を可能にする機能です。 Julia自身内のJuliaコード。

source: As in C and most other imperative or functional languages, the return keyword causes a function to return immediately, providing an expression whose value is returned:
ja: C言語ほかの命令型言語や、関数型言語と同様に、return キーワードを使うと、指定された式の値がすぐに返されます。

source: As in Java, strings are immutable: the value of an AbstractString object cannot be changed.
ja: Javaと同様に、文字列は変更不可能です。つまり AbstractString オブジェクトの値は変更できません。

source: As mentioned above, one can also define new display backends.
ja: 上記のように、新しいディスプレイバックエンドを定義することもできます。

source: As of this writing, the valid Unicode code points are U+00 through U+d7ff and U+e000 through U+10ffff.
ja: 現時点では、有効なコードポイントは U+00 から U+d7ff までと U+e000 から U+10ffffまでとなっています。

source: As such, * is a more natural choice for an infix string concatenation operator, consistent with common mathematical use.
ja: これらのことから、 文字列連結演算子としての* はより数学においての使われ方に準拠した、自然な選択といえるでしょう。

source: As such, it's also possible to define custom array types by inheriting from `AbstractArray`.
ja: このように、カスタム配列タイプを継承することによって、カスタム配列タイプを定義することも可能です。 'AbstractArray'.

source: As the example implies, the following command-line arguments to julia are taken as command-line arguments to the program script.jl, passed in the global constant ARGS.
ja: 上の例が示すように、後ろの引数は script.jl というプログラムのコマンドライン引数として取られ、 グローバル定数 ARGSに渡されます。

source: As the example implies, the following command-line arguments to julia are interpreted as command-line arguments to the program script.jl, passed in the global constant ARGS.
ja: 上の例が示すように、julia に続くコマンドライン引数は、 script.jlというプログラムのコマンドライン引数として取られ、 グローバル定数 ARGSに渡されます。

source: As user code never has to look inside the gsl_permutation
ja: ユーザコードは、gsl_mutationの中では絶対に内部を見る必要がない。

source: As usual, the absolute value (`abs`) of a complex number is its distance from zero.
ja: 通常のように、複素数の絶対値(abs')は、0からの距離である。

source: As usual, the promotion system makes interactions with other numeric types effortless:
ja: 通常のように、プロモーションシステムは、他の数値型との相互作用を容易にします。

source: As we have seen, a typical parametric type has inner constructors that are called when type parameters are known; e.g. they apply to Point{Int} but not to Point.
ja: これまで見てきたように、典型的なパラメトリック型は、型パラメータがある場合に呼び出される内部コンストラクタです。 例えば、それらは点{Int}に適用されるが、点には適用されない。

source: As we have seen, such expressions support interpolation with $.
ja: 前述のように、このような表現は、$x2/>で補間をサポートしています。

source: As with any ccall, it is essential to get the argument signature exactly correct.
ja: 任意のccallと同様に、引数シグニチャを正確に取得することが必須です。

source: As with incomplete objects returned from constructors, if complete_me or any of its callees try to access the data field of the Lazy object before it has been initialized, an error will be thrown immediately.
ja: コンストラクタから返される不完全なオブジェクトの場合と同様に、complete_meまたはその呼び出し先のいずれかである場合 遅延オブジェクトのデータフィールドにアクセスしてから、初期化するようにしてください。エラーが発生すると、エラーが発生する可能性があります。 すぐにスローされます。

source: As with matrix multiplication, string concatenation is noncommutative: greet * whom != whom * greet.
ja: そして文字列の連結は greet * whom != whom * greetであるように行列の乗算と同様、非可換演算です。

source: As with variables, Unicode can also be used for function names:
ja: 変数名と同様に関数名にもUnicodeを使用できます。

source: As you can see, for constructor calls with explicit type parameters, the arguments are converted to the implied field types: Point{Int64}(1,2) works, but Point{Int64}(1.0,2.5) raises an `InexactError` when converting 2.5 to `Int64`.
ja: 明示的な型パラメータを持つコンストラクタ呼び出しでは、引数は変換されます。 点{Int64}(1,2)は動作しますが、点{Int64}(1.0,2.5)は 2.5を"Int64"に変換する際には、'InexactError''となります。

source: As you can see, the arguments must be precisely of type `Float64`.
ja: これを見て分かるように、引数はちょうど`Float64`型でなければなりません。

source: As you can see, the type of the appended element must match the element type of the vector it is appended to, or else a `MethodError` is raised.
ja: ご覧のように、追加する要素の型は、追加されるベクトルの要素の型と一致しなければなりません。でなければ、MethodError が生成されます。

source: Assignment
ja: 割り当て

source: Assignments
ja: 代入

source: Associativity
ja: 結合度

source: At -O3, the compiler might automatically vectorize operations on such tuples.
ja: -O3では、コンパイラ<x/>は、そのようなタプル上のオペレーションを自動的にベクトル化することができます。

source: At expression evaluation time, however, the value of the symbol :b is resolved by looking up the value of the variable b.
ja: しかし、エクスプレッション評価時には、シンボル:bの値が解決されます。 変数bの値を調べます。

source: At the risk of spoiling the suspense, we can reveal here that all it takes is the following outer method definition to make all calls to the general Point constructor work as one would expect:
ja: サスペンスを台無しにする危険性がある場合は、以下のように、すべてが以下の外にあることを明らかにすることができます。 一般的なポイントコンストラクタへのすべての呼び出しを行うメソッド定義は、次のように動作します。

source: Auto-conversion:
ja: 自動変換:

source: Automatic generation of efficient, specialized code for different argument types
ja: それぞれの引数の型ごとに最適化されたコードを自動生成します

source: Background and References
ja: 背景と考察

source: Base.BroadcastStyle(::Type{<:MyType}) = Broadcast.ArrayStyle{MyType}() is preferred if MyType is an AbstractArray.
ja: Base.BroadcastStyle(::Type{<:MyType})=ブロードキャスト.ArrayStyle{MyType}()は優先されます。 MyTypeがAbstractArrayである場合。

source: Base.BroadcastStyle is the abstract type from which all broadcast styles are derived.
ja: Base.BroadcastStyleは、すべてのブロードキャストスタイルが派生する抽象型のタイプです。

source: Base.reverse(::AbstractVector; kwargs...) Base.reverseind Base.reverse!
ja: Base.reverse(::AbstractVector;クワークス.) Base.レヴェルセイント ベース.リバース!

source: Basic Functions
ja: 基本関数

source: Because this is the only inner constructor for OurRational, we can be certain that OurRational objects are always constructed in this normalized form.
ja: なぜなら これは、OurRationalの内部コンストラクタであり、OurRationalオブジェクトがあることは確かです。 常にこの正規化された形式で作成されます。

source: Because Float64 is a concrete type and concrete types cannot be subclassed in Julia, such a definition can only be applied to arguments that are exactly of type Float64.
ja: Float64は具象型で、具象型はJuliaでは、サブクラス化できないので、このような定義はちょうど型がFloat64の引数のみに適用ができます。

source: Because C doesn't support multiple return values, often C functions will take pointers to data that the function will modify.
ja: Cは複数の戻り値をサポートしていないため、しばしばC関数はデータのポインタを取得します。 関数が変更されます。

source: Because Julia's compiler is different from the interpreters used for languages like Python or R, you may find that Julia's performance is unintuitive at first.
ja: JuliaのコンパイラはPythonやRで使われるようなインタプリタとは異なるので、もしかしたら最初はその性能に気づかないかもしれません。

source: Because Julia’s compiler is different from the interpreters used for languages like Python or R, you may find that Julia’s performance is unintuitive at first.
ja: JuliaのコンパイラはPythonやRで使われるようなインタプリタとは異なるので、もしかしたら最初はその性能に気づかないかもしれません。 遅いと感じたら、何かを試す前に Performance Tips を参照することをお勧めします。 Juliaがどのように動作するかを理解すれば、C言語と同等の速さで動くコードを簡単に書くことができるでしょう。

source: Because all data types and code in Julia are represented by Julia data structures, powerful reflection
ja: すべてのデータ型と Juliaのコードは、Juliaのデータ構造で表され、強力なリフレクションで表されます。

source: Because of the lack of a central naming authority, a single project can quite possibly end up depending on different packages that have the same name.
ja: 中央の名前付け権限がないため、同じ名前を持つパッケージによっては、単一のプロジェクトが終了する可能性が非常に高くなります。

source: Because of variable-length encodings, the number of characters in a string (given by `length(s)`) is not always the same as the last index.
ja: 可変長インデックスなので、文字列内の文字数（`length(s)`により取得可能）は、 常に末尾のインデックスの数と同一というわけではありません。

source: Because the function generator is run during inference, it must respect all of the limitations of that code.
ja: 関数ジェネレータは は、そのコードのすべての制限を尊重する必要があります。

source: Before we worry about calling qsort and passing arguments, we need to write a comparison function that works for some arbitrary objects (which define <):
ja: 心配する前に qsortを呼び出して引数を渡す必要があります。 任意のオブジェクト(<を定義します):

source: Behaves like a Ptr{T} that can manage its memory via the Julia GC.
ja: Julia GCを介してメモリを管理することができるPtr{T}のように動作します。

source: Binary (or unary) operators like .+ are handled with the same mechanism: they are equivalent to broadcast calls and are fused with other nested "dot" calls.
ja: .+のようなバイナリ演算子(または単項演算子)は、同じメカニズムで処理されます。 これらは、ブロードキャストコールと同等であり、他のネストされた"ドット"コールと融合されています。

source: Binary and octal literals are also supported:
ja: 2進および8進リテラルについてもサポートされています。:

source: Binary arithmetic -- -, +, *, /, \, ^
ja: バイナリ算術--,+,*,/,,^

source: Binary, octal, and hexadecimal literals may be signed by a - immediately preceding the unsigned literal.
ja: 2進数、8進数、および16進数のリテラルは、符号なしリテラルのすぐ前に-をつけると負号がつきます。

source: Bitshifts
ja: ビットシフト

source: Bitwise Operators
ja: ビット毎の演算

source: Bobcat can and does import both Cobra and Dingo, which both have project files with UUIDs and are declared as dependencies in Bobcat's [deps] section.
ja: ボブキャットは、Cobraとディンゴの両方をインポートしてインポートすることができます。これらは両方ともUUIDを持つプロジェクトファイルを持ち、ボブキャットの[deps]セクションの依存関係として宣言されます。

source: Bobcat cannot depend on Aardvark since Aardvark does not have a project file.
ja: ツチブタはプロジェクトファイルを持たないため、ボブキャットはツチブタに依存することはできません。

source: Boolean operations without short-circuit evaluation can be done with the bitwise boolean operators introduced in Mathematical Operations and Elementary Functions: & and |.
ja: 短絡評価ではないブール演算は、算術処理と基本的な関数で紹介した、 & と |の、ビット単位の論理演算子を使って行うことができます。

source: Both && and || associate to the right, but && has higher precedence than || does.
ja: && と||は共に、右から結合しますが、&&は||より、優先順位が高いです。

source: Both concatenation and string interpolation call `string()` to convert objects into string form.
ja: 補間と文字列連結はいずれもオブジェクトを文字列形式に変換するために `string()`を呼び出します。

source: Both expressions are interpreted as function application: any expression that is not a numeric literal, when immediately followed by a parenthetical, is interpreted as a function applied to the values in parentheses (see Functions for more about functions).
ja: 上記2つの式は関数として解釈されています。括弧を伴う式が直後に続く数値リテラルではない式は、 括弧内の値に適用される関数として解釈されます（詳細は Functionsを参照ください）。

source: Both of these cases throw a DivideError.
ja: これらの場合は両方とも、DivideErrorを throwします。

source: Both of these cases throw a `DivideError`.
ja: どちらの結果も `DivideError`となります。

source: Both these implementations, although different, do essentially the same thing: a runtime loop over the dimensions of the array, collecting the offset in each dimension into the final index.
ja: これらの実装は両方とも異なるが、基本的には、ランタイム・ループと同じものです。 配列の寸法を超えて、各次元のオフセットを最終インデックスに収集します。

source: Both variables (i and j) are set to their current iteration values each time the inner loop runs.
ja: 両方の変数(iとj)は、内部ループが実行されるたびに、それぞれの電流反復値に設定されます。

source: Brief description
ja: 簡単な説明

source: Broadcast Styles
ja: ブロードキャストスタイル

source: Broadcast calls this single answer a "style." Every broadcastable object each has its own preferred style, and a promotion-like system is used to combine these styles into a single answer — the "destination style".
ja: ブロードキャストコールは、この単一の応答を「スタイル」と呼びます。すべてのブロードキャスト可能なオブジェクト それぞれが独自の優先スタイルを持ち、システムのようなプロモーションを使ってこれらを結合します。 スタイルは1つの応答-「destination style」になります。

source: Broadcast must take all the varied types of its arguments and collapse them down to just one output array and one implementation.
ja: ブロードキャストは様々な変化をもたらす 引数の種類と集約を1つの出力配列と1つの出力配列に集約します。 実装。

source: Broadcast.flatten recomputes the potentially nested operation into a single function and flat list of arguments.
ja: broadcast.flatflatingは、ネストされたオペレーションを1つのファイルに再計算します。 引数の関数とフラット・リスト。

source: Broadcasting
ja: 放送

source: Broadcasting behavior of SrcType
ja: SrcTypeのブロードキャスト動作

source: Broadcasting is triggered by an explicit call to broadcast or broadcast!, or implicitly by "dot" operations like A .+ b or f.(x, y).
ja: ブロードキャストは、ブロードキャストブロードキャスト!ブロードキャスト!への明示的な呼び出しによってトリガされます。 A.+bまたはf.(x, y)のような「ドット」操作。

source: Built-in representations of such values are called numeric primitives, while representations of integers and floating-point numbers as immediate values in code are known as numeric literals.
ja: コード内の即値としての整数と浮動小数点値の表現は 数値リテラルとして知られている一方で、ビルトインのこれらの値の表現は数値プリミティブと呼ばれています。

source: But here is a thing you should pay attention to: suppose x is bound to an object of type Array
ja: しかし、ここで注意すべき点は、xが配列型のオブジェクトにバインドされていると仮定することです。

source: But how does one construct the first instance when no instance exists to provide as a valid value for its obj field?
ja: しかし、有効な値として提供するインスタンスが存在しない場合は、最初のインスタンスを構築する方法はどうすればよいのですか。 objフィールドに対して。

source: But neither you, nor any of your callers, nor the functions they call, or etc. can call this new method definition!
ja: しかし、あなたも、呼ぶ関数からも、呼ばれる関数からも、この新しいメソッド定義を呼び出すことはできません！ [訳注:この文の前後は意味がとれませんでした。]

source: But that approach requires you to decide in advance which functions you want to vectorize.
ja: しかしこのアプローチでは事前に決定する必要があります はベクトル化されます。

source: But there's an exception: future calls to newfun
ja: しかし、例外はあります。

source: But, g(x::T) where {T} = ccall(:notvalid, T, (T,), x)
ja: しかし、<T2/>g(x::T)は、{T}=ccall(:ノヴァリド、T、(T,)、x)である。

source: By default, this is the identity function for all AbstractArrays and Numbers — they already support axes and indexing.
ja: by デフォルトでは、すべてのAbstractArrayとの番号の識別関数です。 軸のサポートとインデックス作成をサポートします。

source: By convention, function names ending with an exclamation point (!) modify their arguments.
ja: 慣例によっては、感嘆符(!)で終わる関数名は、引数を変更します。

source: By default this includes:
ja: デフォルトでは、次の内容が含まれます。

source: By default, Fortran compilers generate mangled names (for example, converting function names to lowercase or uppercase, often appending an underscore), and so to call a Fortran function via `ccall` you must pass the mangled identifier corresponding to the rule followed by your Fortran compiler.
ja: デフォルトでは、Fortranコンパイラはmangledを生成します。 名前(例: 関数名を小文字または大文字に変換し、通常は アンダースコア)は、Fortran関数を`ccall`経由で呼び出す必要があります。 ルールに従うルールに従って、ルールに対応するマクロ識別子を指定します。 コンパイラー。

source: By default, Fortran compilers generate mangled names (for example, converting function names to lowercase or uppercase, often appending an underscore), and so to call a Fortran function via `ccall` you must pass the mangled identifier corresponding to the rule followed by your Fortran compiler. Also, when calling a Fortran function, all inputs must be passed as pointers to allocated values on the heap or stack. This applies not only to arrays and other mutable objects which are normally heap-allocated, but also to scalar values such as integers and floats which are normally stack-allocated and commonly passed in registers when using C or Julia calling conventions.
ja: デフォルトでは、Fortranコンパイラはmangledを生成します。 名前(例: 関数名を小文字または大文字に変換し、通常は アンダースコア)は、Fortran関数を`ccall`経由で呼び出す必要があります。 ルールに従うルールに従って、ルールに対応するマクロ識別子を指定します。 コンパイラー。また、Fortran関数を呼び出す場合は、すべての入力が必要です。 ヒープまたはスタック上の割り当てられた値へのポインタです。これは 通常はヒープ割り当てされた配列やその他のmutableオブジェクトですが 通常スタック割り当てされた整数や浮動小数点のようなスカラー値 一般的には、CまたはJuliaの呼び出し規約を使用するときにレジスタで渡されます。

source: By default, Julia picks reasonable algorithms and sorts in standard ascending order:
ja: デフォルトでは、Juliaは標準的な昇順で妥当なアルゴリズムとソートを選択します。

source: By definition, eps(1.0) is the same as eps(Float64) since 1.0 is a 64-bit floating-point value.
ja: 定義により、eps(1.0) はeps(Float64)です。なぜなら、1.0 は、 64ビットの浮動小数点値です。

source: By extending the `eltype` method, we can give that information to Julia and help it make more specialized code in the more complicated methods.
ja: `eltype` の方法を拡張することにより、Julia に情報を提供し、より専門的なものにする手助けをすることができます。 より複雑なメソッドのコードです。
